posts/2021-10-24-add-extra-build-tools-to-haskell.nix-project.org
#+title: Add extra build tools to haskell.nix project
#+date: <2021-10-24 21:08>
#+description: How to add extra build tools to a haskell.nix project
#+filetags: haskell.nix::buildtools::plugin
* Why
Sometimes you will need some extra tools to build your project. For the ~RecordDotSyntax~ feature, you will need a
ghc plugin or a pre processer to build.

* Cabal build-tool-depends
This flag is used by cabal, but looks like cabal only builds the library but won't add the executable into the PATH
during the following build process. There is a issue to track this: [[https://github.com/haskell/cabal/issues/8434]]

* haskell.nix executableToolDepends
There also is a issue track in haskell.nix: [[https://github.com/input-output-hk/haskell.nix/issues/839]]
