2021-10-24-add-extra-build-tools-to-haskell.nix-project.html
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="description" content=
    "How to add extra build tools to a haskell.nix project">
    <link rel="alternate" type="application/rss+xml" href=
    "https://hughjfchen.github.io/rss.xml" title=
    "RSS feed for https://hughjfchen.github.io/">
    <title>Add extra build tools to haskell.nix project</title>
    <meta name="author" content="Hugh Chen">
    <meta name="referrer" content="no-referrer">
    <link href="static/default.css" rel="stylesheet" type=
    "text/css">
    <link href="static/code.css" rel="stylesheet" type="text/css">
    <link rel="icon" href="static/favicon.ico">
    <meta name="viewport" content=
    "width=device-width, initial-scale=1">
    <meta name="generator" content="org-blog-static">
</head>
<body>
    <div id="preamble" class="status">
        <p id="blogname"><a href="index.html">Hugh JF Chen's
        Blog</a></p>
        <p></p>
        <p id="i&quot;catchphrase&quot;">'My personal blog for
        computation!</p><br>
        <div id="nav">
            <a href="about.html">About</a> <span class=
            "sep">|</span> <a href="archive.html">Archive</a>
            <span class="sep">|</span> <a href="tags.html">Tags</a>
            <span class="sep">|</span> <a href="rss.xml">Rss</a>
        </div>
    </div>
    <div id="content">
        <div class="post-date">
            24 Oct 2021
        </div>
        <h1 class="post-title"><a href=
        "https://hughjfchen.github.io/2021-10-24-add-extra-build-tools-to-haskell.nix-project.html">
        Add extra build tools to haskell.nix project</a></h1>
        <div id="outline-container-org197312c" class="outline-2">
            <h2 id="org197312c"><span class=
            "section-number-2">1.</span> Why</h2>
            <div class="outline-text-2" id="text-1">
                <p>Sometimes you will need some extra tools to
                build your project. For the
                <code>RecordDotSyntax</code> feature, you will need
                a ghc plugin or a pre processer to build.</p>
            </div>
        </div>
        <div id="outline-container-orgd47fd47" class="outline-2">
            <h2 id="orgd47fd47"><span class=
            "section-number-2">2.</span> Cabal
            build-tool-depends</h2>
            <div class="outline-text-2" id="text-2">
                <p>This flag is used by cabal, but looks like cabal
                only builds the library but won’t add the
                executable into the PATH during the following build
                process. There is a issue to track this: <a href=
                "https://github.com/haskell/cabal/issues/8434">https://github.com/haskell/cabal/issues/8434</a></p>
            </div>
        </div>
        <div id="outline-container-org216d492" class="outline-2">
            <h2 id="org216d492"><span class=
            "section-number-2">3.</span> haskell.nix
            executableToolDepends</h2>
            <div class="outline-text-2" id="text-3">
                <p>There also is a issue track in haskell.nix:
                <a href=
                "https://github.com/input-output-hk/haskell.nix/issues/839">
                https://github.com/input-output-hk/haskell.nix/issues/839</a></p>
            </div>
        </div>
        <div class="taglist">
            <a href=
            "https://hughjfchen.github.io/tags.html">Tags</a>:
            <a href="https://hughjfchen.github.io/tag-.html"></a>
            <a href=
            "https://hughjfchen.github.io/tag-haskell.nix.html">haskell.nix</a>
            <a href="https://hughjfchen.github.io/tag-.html"></a>
            <a href=
            "https://hughjfchen.github.io/tag-buildtools.html">buildtools</a>
            <a href="https://hughjfchen.github.io/tag-.html"></a>
            <a href=
            "https://hughjfchen.github.io/tag-plugin.html">plugin</a>
            <a href="https://hughjfchen.github.io/tag-.html"></a>
        </div>
    </div>
    <div id="postamble" class="status">
        <footer>
            This site belongs to <a href="index.html">Hugh JF
            Chen</a> and the content is published under <a href=
            "http://creativecommons.org/licenses/by-nc-sa/4.0/">CC
            BY-NC-SA 4.0</a> license.<br>
        </footer>
    </div>
</body>
</html>
